# NewFormByCap Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyItemFactory..::..NewFormByCap Method
FamilyItemFactory Class See Also
---
Create new Form element by cap operation (to create a single-surface form), and add it into the Autodesk Revit family document.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Form NewFormByCap(
	bool isSolid,
	ReferenceArray profile
)
```

Visual Basic
---
```text
Public Function NewFormByCap ( _
	isSolid As Boolean, _
	profile As ReferenceArray _
) As Form
```

Visual C++
---
```text
public:
Form^ NewFormByCap(
	bool isSolid,
	ReferenceArray^ profile
)
```

# ### Parameters
isSolid
    Type: System..::..BooleanIndicates if the Form is Solid or Void.
profile
    Type: Autodesk.Revit.DB..::..ReferenceArrayThe profile of the newly created cap. It should consist of only one curve loop.
# ### Return Value
If creation was successful new form is returned.
# See Also
FamilyItemFactory Class
Autodesk.Revit.Creation Namespace